Catalogs/КалькуляторПланаВознаграждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>КалькуляторПланаВознаграждения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
				<xr:Item>Document.ПланВознагражденияПосредника</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Посредник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КалькуляторПланаВознаграждения/Ext/ObjectModule.bsl
Функция РодительКалькуляциПланаВознаграждения( Исполнитель, Проект )
	РодительКЗ 	= СоздатьИерархию( "КалькуляторПланаВознаграждения", 
									СокрЛП( Исполнитель ) + "/" + 
									СокрЛП( Проект ));
									
	Возврат РодительКЗ;
КонецФункции



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗначениеЗаполнено( ДанныеЗаполнения ) Тогда
		Если ТипЗнч( ДанныеЗаполнения ) = Тип("СправочникСсылка.ЗадачиПроектов") Тогда
		// из задачи проекта
			
			ЗадачаПроекта	= ДанныеЗаполнения.Ссылка;
			
		Иначе
		// из документа
			ЗадачаПроекта	= ДанныеЗаполнения.Ссылка.ЗадачаПроекта;
			// 
			Начисления.Загрузить( ДанныеЗаполнения.Начисления.Выгрузить());
		
			
		КонецЕсли;
		
		Наименование 	= ЗадачаПроекта.Наименование;
		Родитель		= РодительКалькуляциПланаВознаграждения( ИсполнительДокумента, ЗадачаПроекта.Владелец);
		
	КонецЕсли;
КонецПроцедуры
